#### import pandas as pd
import numpy as np

## 建立Series(pd.Series([],index),pd.Series(dict),pd.Series(dict,index)只取dict中index的值)與取值(loc根據index值取,iloc根據位置取,沒有加則以iloc為主,一個則以loc為主)

In [2]:
data=pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data[1]

0.5

In [6]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [7]:
data[(data>0.3)&(data<0.8)]

1    0.50
2    0.75
dtype: float64

In [8]:
data=pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])
data['b']
'a' in data

True

In [9]:
data=pd.Series([0.25,0.5,0.75,1.0],index=["a","b","c","d"])

In [10]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [11]:
data["b"]

0.5

In [13]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [14]:
population_dict={'California':38332521,
                'Texas':26448193,
                'New York':19651127,
                'Florida':19552860,
                'Illinois':12882135}

In [15]:
population=pd.Series(population_dict)

In [16]:
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [17]:
population["California":"Illinois"]

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [18]:
population[["California","Illinois"]]

California    38332521
Illinois      12882135
dtype: int64

In [19]:
pd.Series(5,index=[100,200,300])

100    5
200    5
300    5
dtype: int64

In [21]:
pd.Series({2:"a",1:"b",3:"c"})

2    a
1    b
3    c
dtype: object

In [22]:
pd.Series({2:"a",1:"b",3:"c"},index=[3,2])

3    c
2    a
dtype: object

In [23]:
data=pd.Series(['a','b','c'],index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [24]:
data[1:3]

3    b
5    c
dtype: object

In [25]:
data[1]

'a'

In [26]:
data.loc[1]

'a'

In [27]:
data.loc[1:3]

1    a
3    b
dtype: object

In [28]:
data.iloc[1]

'b'

In [29]:
data.iloc[1:3]

3    b
5    c
dtype: object

## 建立dataframe(pd.DataFrame(dict)dict中放pd.Series,pd.DataFrame(pd.Series,columns)),pd.DataFrame(list(dict))一列一列放,pd.DataFrame(array,columns,index),pd.DataFrame(結構化陣列)

In [30]:
area_dict={'California':423967,'Texas':695662,'New York':141297,'Florida':170312,'Illinois':149995}

In [31]:
area=pd.Series(area_dict)

In [32]:
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [33]:
states=pd.DataFrame({'population':population,'area':area})

In [34]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [35]:
states.columns

Index(['population', 'area'], dtype='object')

In [36]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [37]:
pd.DataFrame(population,columns=["population"])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [38]:
data=[{'a':i,'b':2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [40]:
pd.DataFrame([{'a':1,"b":2},{"b":3,'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [41]:
pd.DataFrame(np.random.rand(3,2),columns=["foo","bar"],index=["a","b","c"])

        foo       bar
a  0.530182  0.954674
b  0.224753  0.597711
c  0.756055  0.874430

In [42]:
A=np.zeros(3,dtype=[('A','i8'),('B','f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [43]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

## dataframe取值

In [44]:
area=pd.Series({'California':423967,'Texas':695662,'New York':141297,'Florida':170312,'Illinois':149995})

In [45]:
pop=pd.Series({'California':38332521,'Texas':26448193,'New York':19651127,'Florida':19552860,'Illinois':12882135})

In [46]:
data=pd.DataFrame({'area':area,'pop':pop})

In [47]:
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [48]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [49]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [50]:
data['density']=data['pop']/data['area']

In [51]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [52]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [53]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [54]:
data.loc[:"Illinois",:"pop"]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [55]:
data.ix[:3,:"pop"]

C:\Users\a2279\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [56]:
data.loc[data.density>100,["pop","density"]]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [57]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [58]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [59]:
data.loc[:"Illinois",:"pop"]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [45]:
data.ix[:3,:"pop"]

C:\Users\a2279\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [60]:
data.iloc[0,2]=90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [ ]:
train = data.query('train == 1')
test = data.query('train == 0')

In [ ]:
births=births.query('(births>@mu-5*@sig) & (births<@mu+5*@sig)')

In [62]:
for index,row in data.iterrows():
    print(row)

area         423967.0
pop        38332521.0
density          90.0
Name: California, dtype: float64
area       6.956620e+05
pop        2.644819e+07
density    3.801874e+01
Name: Texas, dtype: float64
area       1.412970e+05
pop        1.965113e+07
density    1.390767e+02
Name: New York, dtype: float64
area       1.703120e+05
pop        1.955286e+07
density    1.148061e+02
Name: Florida, dtype: float64
area       1.499950e+05
pop        1.288214e+07
density    8.588376e+01
Name: Illinois, dtype: float64

## Series,dataframe計算:A.add(B,fill_value),A.substract(B,fill_value),A-Series(指定column要減多少)

In [63]:
area=pd.Series({'Alaska':1723337,'Texas':695662,'California':423967},name="area")
population=pd.Series({'New York':19651127,'Texas':26448193,'California':38332521},name="population")

In [64]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [65]:
area.index|population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [68]:
A=pd.Series([2,4,6],index=[0,1,2])
B=pd.Series([1,3,5],index=[1,2,3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [69]:
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [70]:
rng=np.random.RandomState(42)

In [71]:
A=pd.DataFrame(rng.randint(0,20,(2,2)),columns=list('AB'))
A

    A   B
0   6  19
1  14  10

In [72]:
B=pd.DataFrame(rng.randint(0,10,(3,3)),columns=list('BAC'))
B

   B  A  C
0  7  4  6
1  9  2  6
2  7  4  3

In [73]:
A+B

      A     B   C
0  10.0  26.0 NaN
1  16.0  19.0 NaN
2   NaN   NaN NaN

In [74]:
fill=A.stack().mean()
fill

12.25

In [75]:
fill=A.stack().mean()
A.add(B,fill_value=fill)

       A      B      C
0  10.00  26.00  18.25
1  16.00  19.00  18.25
2  16.25  19.25  15.25

In [76]:
A=rng.randint(10,size=(3,4))
A

array([[7, 7, 2, 5],
       [4, 1, 7, 5],
       [1, 4, 0, 9]])

In [77]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-3, -6,  5,  0],
       [-6, -3, -2,  4]])

In [78]:
df=pd.DataFrame(A,columns=list('QRST'))
df-df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -3 -6  5  0
2 -6 -3 -2  4

In [79]:
df.subtract(df['R'],axis=1)

    Q   R   S   T   0   1   2
0 NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN

In [80]:
df.subtract(df['R'],axis=0)

   Q  R  S  T
0  0  0 -5 -2
1  3  0  6  4
2 -3  0 -4  5

In [81]:
halfrow=df.iloc[0,::2]
halfrow

Q    7
S    2
Name: 0, dtype: int32

In [82]:
df-halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -3.0 NaN  5.0 NaN
2 -6.0 NaN -2.0 NaN

## 資料分組aggregate(dict):每一行要做的統計量,aggregate(list):所有行要做那些統計量, .sum(),[column].sum(), .rename(columns=dict)
## groupby([column],as_index=False):也可另外建list分組,groupby(list):指定分割建,groupby(dict):指定分割建

In [ ]:
song_count = train.loc[:,["song_id","target"]]

# measure repeat count by played songs
song_count1 = song_count.groupby(["song_id"],as_index=False).sum().rename(columns={"target":"repeat_count"})

# count play count by songs
song_count2 = song_count.groupby(["song_id"],as_index=False).count().rename(columns = {"target":"play_count"})

In [ ]:
song_repeats=repeats.groupby('song_id',as_index=False).msno.count()
song_repeats.columns=['song_id','count']

In [83]:
import seaborn as sns
planets=sns.load_dataset("planets")

In [84]:
for (method,group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method,group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [87]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.000000
       Eclipse Timing Variations           9.000000
       Imaging                            38.000000
       Microlensing                       23.000000
       Orbital Brightness Modulation       3.000000
       Pulsar Timing                       5.000000
       Pulsation Timing Variations         1.000000
       Radial Velocity                   553.000000
       Transit                           397.000000
       Transit Timing Variations           4.000000
mean   Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.131579
       Microlensing                     2009.782609
       Orbital Brightness Modulation    2011.666667
       Pulsar Timing                    1998.400000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2007.518987
       Transit                          2011.236776
       Transit Timing Variations        2012.500000
std    Astrometry                          2.121320
       Eclipse Timing Variations           1.414214
       Imaging                             2.781901
       Microlensing                        2.859697
       Orbital Brightness Modulation       1.154701
       Pulsar Timing                       8.384510
       Pulsation Timing Variations              NaN
       Radial Velocity                     4.249052
       Transit                             2.077867
       Transit Timing Variations           1.290994
                                           ...
50%    Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.000000
       Microlensing                     2010.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1994.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2009.000000
       Transit                          2012.000000
       Transit Timing Variations        2012.500000
75%    Astrometry                       2012.250000
       Eclipse Timing Variations        2011.000000
       Imaging                          2011.000000
       Microlensing                     2012.000000
       Orbital Brightness Modulation    2012.000000
       Pulsar Timing                    2003.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2011.000000
       Transit                          2013.000000
       Transit Timing Variations        2013.250000
max    Astrometry                       2013.000000
       Eclipse Timing Variations        2012.000000
       Imaging                          2013.000000
       Microlensing                     2013.000000
       Orbital Brightness Modulation    2013.000000
       Pulsar Timing                    2011.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2014.000000
       Transit                          2014.000000
       Transit Timing Variations        2014.000000
Length: 80, dtype: float64

In [88]:
rng=np.random.RandomState(0)
df=pd.DataFrame({'key':['A','B','C','A','B','C'],'data1':range(6),'data2':rng.randint(0,10,6)},columns=['key','data1','data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [89]:
df.groupby('key').aggregate(['min',np.median,'max'])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [90]:
df.groupby('key').aggregate({'data1':'min',"data2":"max"})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [91]:
L=[0,1,0,1,2,0]
print(df);print(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
   data1  data2
0      7     17
1      4      3
2      4      7

In [92]:
df2=df.set_index('key')
mapping={'A':'vowel','B':'consonant','C':'consonant'}
print(df2);print(df2.groupby(mapping).sum())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9
           data1  data2
consonant     12     19
vowel          3      8

In [93]:
print(df2);print(df2.groupby(str.lower).mean())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9
   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

In [94]:
df2.groupby([str.lower,mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0

In [95]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [96]:
decade=10*(planets['year']//10)

In [97]:
decade=decade.astype(str)+'s'
decade.name='decade'

In [98]:
decade=decade.astype(str)+'s'
decade.name='decade'
planets.groupby(['method',decade])['number'].sum().unstack().fillna(0)

decade                         1980ss  1990ss  2000ss  2010ss
method
Astrometry                        0.0     0.0     0.0     2.0
Eclipse Timing Variations         0.0     0.0     5.0    10.0
Imaging                           0.0     0.0    29.0    21.0
Microlensing                      0.0     0.0    12.0    15.0
Orbital Brightness Modulation     0.0     0.0     0.0     5.0
Pulsar Timing                     0.0     9.0     1.0     1.0
Pulsation Timing Variations       0.0     0.0     1.0     0.0
Radial Velocity                   1.0    52.0   475.0   424.0
Transit                           0.0     0.0    64.0   712.0
Transit Timing Variations         0.0     0.0     0.0     9.0

## 資料過濾

In [99]:
def filter_func(x):
    return x['data2'].std()>4

In [100]:
print(df);print(df.groupby('key').std());
print(df.groupby('key').filter(filter_func))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

## 資料轉換:transform,apply

In [101]:
df.groupby('key').transform(lambda x:x-x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [11]:
def norm_by_data2(x):
    x['data1']/=x['data2'].sum()
    return x

In [12]:
print(df);print(df.groupby('key').apply(norm_by_data2))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

## 資料計數

In [ ]:
train.target.value_counts()

In [ ]:
print(train.target.value_counts()*100/train.target.value_counts().sum())

## 資料排序

In [ ]:
print('median length of songs repeated',song_repeats.sort_values(by='count',ascending=False)[:2000]["song_length"].median())

## 資料取代

In [ ]:
song_repeat['repeat_percentage'] = song_repeat['repeat_percentage'].replace(100.0,np.nan)

## series資料合併pd.concat([series,series]),可加axis=1,join="inner",join_axes=[columns],ignore_index=True,keys=[list]
## .append()

In [102]:
def make_df(cols,ind):
    data={c:[str(c)+str(i) for i in ind] for c in cols}
    return pd.DataFrame(data,ind)

In [103]:
ser1=pd.Series(['A','B','C'],index=[1,2,3])
ser2=pd.Series(['D','E','F'],index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [104]:
df1=make_df('AB',[1,2])
df2=make_df('AB',[3,4])
print(df1);print(df2);print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [105]:
df3=make_df('AB',[0,1])
df4=make_df('CD',[0,1])
print(df3);print(df4);print(pd.concat([df3,df4],axis=1))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [106]:
x=make_df('AB',[0,1])
y=make_df('AB',[2,3])
y.index=x.index
print(x);print(y);print(pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [107]:
print(x);print(y);print(pd.concat([x,y],ignore_index=True))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [108]:
print(x);print(y);print(pd.concat([x,y],keys=['x','y']))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [109]:
df5=make_df('ABC',[1,2])
df6=make_df('BCD',[3,4])
print(df5);print(df6);print(pd.concat([df5,df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\Users\a2279\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

In [111]:
print(df5);print(df6);print(pd.concat([df5,df6],join="inner"))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [112]:
print(df5);print(df6);print(pd.concat([df5,df6],join_axes=[df5.columns]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

In [113]:
print(df1);print(df2);print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

## how("left","outer"),on,left_on,right_on,left_index.right_index,suffixes
## .join()

In [ ]:
song_repeats=pd.DataFrame(song_repeats).merge(songs,left_on='song_id',right_on='song_id')

In [ ]:
test = data['test'].merge(data['members'], how='left', on='msno')

In [114]:
df1=pd.DataFrame({'employee':["Bob","Jake","Lisa","Sue"],'group':["Accounting","Engineering","Engineering","HR"]})

In [115]:
df2=pd.DataFrame({'employee':["Lisa","Bob","Jake","Sue"],"hire_date":[2004,2008,2012,2014]})

In [116]:
print(df1);print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [117]:
df3=pd.merge(df1,df2)

In [118]:
df4=pd.DataFrame({'group':['Accounting','Engineering','HR'],'supervisor':["Carly","Guido","Steve"]})

In [119]:
print(df3);print(df4);print(pd.merge(df3,df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [120]:
df5=pd.DataFrame({'group':["Accounting","Accounting","Engineering","Engineering","HR","HR"],"skill":["math","spreadsheets","coding","linux","spreadsheets","organization"]})

In [121]:
print(df1);print(df5);print(pd.merge(df1,df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group         skill
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group         skill
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [122]:
print(df1);print(df2);print(pd.merge(df1,df2,on="employee"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [123]:
df3=pd.DataFrame({'name':["Bob","Jake","Lisa","Sue"],"salary":[70000,80000,120000,90000]})
print(df1);print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [124]:
print(pd.merge(df1,df3,left_on="employee",right_on="name"))

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [125]:
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')
print(df1a);print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [126]:
print(df1a);print(df2a);
print(pd.merge(df1a,df2a,left_index=True,right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [127]:
print(df1a);print(df2a);print(df1a.join(df2a))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [128]:
print(df1a);print(df3);
print(pd.merge(df1a,df3,left_index=True,right_on="name"))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [129]:
df6=pd.DataFrame({'name':['Peter','Paul','Mary'],'food':['fish','beans','bread']},columns=["name","food"])
df7=pd.DataFrame({'name':["Mary","Joseph"],'drink':['wine',"beer"]})
print(df6);print(df7);print(pd.merge(df6,df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [130]:
print(df6);print(df7);print(pd.merge(df6,df7,how="outer"))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [131]:
print(df6);print(df7);print(pd.merge(df6,df7,how="left"))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [132]:
df8=pd.DataFrame({'name':['Bob',"Jake","Lisa","Sue"],'rank':[1,2,3,4]})
df9=pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],'rank':[3,1,4,2]})
print(df8);print(df9);print(pd.merge(df8,df9,on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [133]:
print(df8);print(df9);
print(pd.merge(df8,df9,on="name",suffixes=["_L","_R"]))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

## dataframe統計量(axis, level)

## pivot_table(統計欄位,index,col),pivot_table(index,col,aggfunc(dict)每個欄位如何統計),margins=TRUE

In [134]:
df=pd.DataFrame({'A':rng.rand(5),'B':rng.rand(5)})
df

          A         B
0  0.623564  0.477665
1  0.384382  0.812169
2  0.297535  0.479977
3  0.056713  0.392785
4  0.272656  0.836079

In [135]:
df.mean()

A    0.326970
B    0.599735
dtype: float64

In [136]:
df.mean(axis='columns')

0    0.550614
1    0.598275
2    0.388756
3    0.224749
4    0.554368
dtype: float64

In [137]:
health_data
data_mean=health_data.mean(level='year')
data_mean
data_mean.mean(axis=1,level='type')

NameError: name 'health_data' is not defined

In [138]:
import seaborn as sns
titanic=sns.load_dataset('titanic')

In [139]:
titanic.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [140]:
age=pd.cut(titanic['age'],[0,18,80])
titanic.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [141]:
fare=pd.qcut(titanic['fare'],2)
titanic.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

In [142]:
titanic.pivot_table(index='sex',columns='class',aggfunc={'survived':sum,'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [143]:
titanic.pivot_table('survived',index='sex',columns='class',margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [67]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  1  258k    1  2742    0     0   2742      0  0:01:36  0:00:01  0:01:35  2659
 36  258k   36 95970    0     0  95970      0  0:00:02  0:00:01  0:00:01 59645
100  258k  100  258k    0     0   129k      0  0:00:02  0:00:02 --:--:--  121k

In [68]:
births=pd.read_csv("births.csv")

In [69]:
births['decade']=10*(births['year']//10)

In [73]:
births.head()

   year  month  day gender  births  decade
0  1969      1  1.0      F    4046    1960
1  1969      1  1.0      M    4440    1960
2  1969      1  2.0      F    4454    1960
3  1969      1  2.0      M    4548    1960
4  1969      1  3.0      F    4548    1960

In [71]:
births.pivot_table('births',index='decade',columns='gender',aggfunc='sum')

gender         F         M
decade
1960     1753634   1846572
1970    16263075  17121550
1980    18310351  19243452
1990    19479454  20420553
2000    18229309  19106428

In [75]:
quartiles=np.percentile(births['births'],[25,50,75])
mu=quartiles[1]
sig=0.74*(quartiles[2]-quartiles[0])

In [76]:
births=births.query('(births>@mu-5*@sig) & (births<@mu+5*@sig)')

## 處理時間變數

## pd.to_datetime(20200626,format="%Y%m%d"),pd.datetime(2020,6,26)

In [77]:
births['day']=births['day'].astype(int)

In [78]:
births.index=pd.to_datetime(10000*births.year+100*births.month+births.day,format="%Y%m%d")

In [79]:
births["dayofweek"]=births.index.dayofweek

In [80]:
births_by_date=births.pivot_table('births',[births.index.month,births.index.day])
births_by_date.head()

       births
1 1  4009.225
  2  4247.400
  3  4500.900
  4  4571.350
  5  4603.625

In [82]:
births_by_date.index=[pd.datetime(2012,month,day) for (month,day) in births_by_date.index]
births_by_date.head()

              births
2012-01-01  4009.225
2012-01-02  4247.400
2012-01-03  4500.900
2012-01-04  4571.350
2012-01-05  4603.625

## 多重索引:pd.MultiIndex.from_tuples([()]),pd.MultiIndex.from_arrays([[]]),
## pd.MultiIndex.from_product([[]]),pd.MultiIndex(levels=[['a','b'],[1,2]],labels=[[0,0,1,1],[0,1,0,1]])

## 取值:idx=pd.IndexSlice(idx[,]表示index位置,idx[,]表示columns位置)

## unstack(level=0or1)

In [144]:
ind=pd.Index([2,3,5,7,11])
ind
indA=pd.Index([1,3,5,7,9])
indB=pd.Index([2,3,5,7,11])
indA&indB
indA|indB
indA^indB

Int64Index([1, 2, 9, 11], dtype='int64')

In [145]:
index=[('California',2000),('California',2010),('New York',2000),('New York',2010),('Texas',2000),('Texas',2010)]
populations=[33871648,37253956,18976457,19378102,20851820,25145561]
pop=pd.Series(populations,index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [146]:
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [147]:
pop[[i for i in pop.index if i[1]==2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [148]:
index=pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [149]:
pop=pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [150]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [151]:
pop_df=pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [152]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [153]:
pop_df=pd.DataFrame({'total':pop,'under18':[9267089,9284094,4687374,4318033,5906301,6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [154]:
f_u18=pop_df["under18"]/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [155]:
df=pd.DataFrame(np.random.rand(4,2),index=[['a','a','b','b'],[1,2,1,2]],columns=['data1','data2'])
df

        data1     data2
a 1  0.843767  0.189776
  2  0.365979  0.487826
b 1  0.641474  0.298656
  2  0.389239  0.827559

In [156]:
data={('California',2000):33871648,('California',2010):37253956,('Texas',2000):20851820,('Texas',2010):25145561,('New York',2000):18976457,('New York',2010):19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [157]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [158]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [159]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [160]:
pd.MultiIndex(levels=[['a','b'],[1,2]],labels=[[0,0,1,1],[0,1,0,1]])

C:\Users\a2279\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: the 'labels' keyword is deprecated, use 'codes' instead
  """Entry point for launching an IPython kernel.

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [161]:
pop.index.names=['state','year']

In [162]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [163]:
index=pd.MultiIndex.from_product([[2013,2014],[1,2]],names=["year","visit"])

In [164]:
columns=pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],names=['subject','type'])

In [165]:
data=np.round(np.random.randn(4,6),1)
data[:,::2]*=10
data+=37

In [166]:
data

array([[32. , 36.8, 42. , 36.5, 28. , 37.5],
       [33. , 37.5, 35. , 37.5, 53. , 36. ],
       [36. , 36.3, 45. , 36.4, 34. , 37. ],
       [36. , 35.8, 34. , 36.7, 56. , 38.1]])

In [167]:
health_data=pd.DataFrame(data,index=index,columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      32.0  36.8  42.0  36.5  28.0  37.5
     2      33.0  37.5  35.0  37.5  53.0  36.0
2014 1      36.0  36.3  45.0  36.4  34.0  37.0
     2      36.0  35.8  34.0  36.7  56.0  38.1

In [26]:
health_data["Guido"]

type          HR  Temp
year visit
2013 1      48.0  36.5
     2      26.0  36.5
2014 1      27.0  37.1
     2      28.0  37.9

In [168]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [169]:
pop['California',2000]

33871648

In [170]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [171]:
pop.loc["California":"New York"]

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [172]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [173]:
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [174]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [175]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      32.0  36.8  42.0  36.5  28.0  37.5
     2      33.0  37.5  35.0  37.5  53.0  36.0
2014 1      36.0  36.3  45.0  36.4  34.0  37.0
     2      36.0  35.8  34.0  36.7  56.0  38.1

In [177]:
health_data['Guido','HR']

year  visit
2013  1        42.0
      2        35.0
2014  1        45.0
      2        34.0
Name: (Guido, HR), dtype: float64

In [178]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      32.0  36.8
     2      33.0  37.5

In [179]:
health_data.loc[:,('Bob','HR')]

year  visit
2013  1        32.0
      2        33.0
2014  1        36.0
      2        36.0
Name: (Bob, HR), dtype: float64

In [180]:
idx=pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      32.0  42.0  28.0
2014 1      36.0  45.0  34.0

In [181]:
index=pd.MultiIndex.from_product([['a','b','c'],[1,2]])
data=pd.Series(np.random.rand(6),index=index)
data.index.names=["char","int"]
data

char  int
a     1      0.095350
      2      0.702023
b     1      0.102614
      2      0.561361
c     1      0.249798
      2      0.913450
dtype: float64

In [183]:
data.sort_index()
data

char  int
a     1      0.095350
      2      0.702023
b     1      0.102614
      2      0.561361
c     1      0.249798
      2      0.913450
dtype: float64

In [184]:
data["a":"b"]

char  int
a     1      0.095350
      2      0.702023
b     1      0.102614
      2      0.561361
dtype: float64

In [185]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [186]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [187]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [188]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## 索引設定,重設與與聚合

In [189]:
pop_flat=pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [190]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561